; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_3 type_2)
 (:predicates (pred_2 ?v4 - type_3 ?v6 - type_1)
 	      (pred_1 ?v3 - object ?v6 - type_1)
	      (pred_4 ?v4 - type_3 ?v1 - type_2)
	      (pred_3 ?v4 - type_3 ?v3 - object ?v1 - type_2))

   (:action op_1
       :parameters  (?v4 - type_3 ?v2 ?v8 - type_1)
       :precondition (and  (pred_2 ?v4 ?v2))
       :effect (and  (pred_2 ?v4 ?v8)
		     (not (pred_2 ?v4 ?v2))))

   (:action op_2
       :parameters (?v4 - type_3 ?v7 - object ?v5 - type_1 ?v1 - type_2)
       :precondition  (and  (pred_1 ?v7 ?v5) (pred_2 ?v4 ?v5) (pred_4 ?v4 ?v1))
       :effect (and (pred_3 ?v4 ?v7 ?v1)
		    (not (pred_1 ?v7 ?v5)) 
		    (not (pred_4 ?v4 ?v1))))

   (:action op_3
       :parameters (?v4 - type_3 ?v7 - object ?v5 - type_1 ?v1 - type_2)
       :precondition  (and  (pred_3 ?v4 ?v7 ?v1) (pred_2 ?v4 ?v5))
       :effect (and (pred_1 ?v7 ?v5)
		    (pred_4 ?v4 ?v1)
		    (not (pred_3 ?v4 ?v7 ?v1)))))

; problem
(define (problem gripper-1-4-3)
(:domain gripper-strips)
(:objects obj_03 - type_3
obj_05 obj_04 - type_2
obj_07 obj_02 obj_06 obj_08 - type_1
obj_01 obj_09 obj_10 - object)
(:init
(pred_2 obj_03 obj_08)
(pred_4 obj_03 obj_05)
(pred_4 obj_03 obj_04)
(pred_1 obj_01 obj_08)
(pred_1 obj_09 obj_06)
(pred_1 obj_10 obj_07)
)
(:goal
(and
(pred_1 obj_01 obj_06)
(pred_1 obj_09 obj_08)
(pred_1 obj_10 obj_02)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_3 obj_03 ?b obj_04))))
)
)

; plan
1. (op_2 obj_03 obj_01 obj_08 obj_05)
   deleted: (pred_1 obj_01 obj_08) (pred_4 obj_03 obj_05)
   added: (pred_3 obj_03 obj_01 obj_05)
   goals met: 0 of 3
2. (op_1 obj_03 obj_08 obj_06)
   deleted: (pred_2 obj_03 obj_08)
   added: (pred_2 obj_03 obj_06)
   goals met: 0 of 3
3. (op_3 obj_03 obj_01 obj_06 obj_05)
   deleted: (pred_3 obj_03 obj_01 obj_05)
   added: (pred_1 obj_01 obj_06) (pred_4 obj_03 obj_05)
   goals met: 1 of 3
4. (op_2 obj_03 obj_09 obj_06 obj_05)
   deleted: (pred_1 obj_09 obj_06) (pred_4 obj_03 obj_05)
   added: (pred_3 obj_03 obj_09 obj_05)
   goals met: 1 of 3
5. (op_1 obj_03 obj_06 obj_08)
   deleted: (pred_2 obj_03 obj_06)
   added: (pred_2 obj_03 obj_08)
   goals met: 1 of 3
6. (op_3 obj_03 obj_09 obj_08 obj_05)
   deleted: (pred_3 obj_03 obj_09 obj_05)
   added: (pred_1 obj_09 obj_08) (pred_4 obj_03 obj_05)
   goals met: 2 of 3
7. (op_1 obj_03 obj_08 obj_07)
   deleted: (pred_2 obj_03 obj_08)
   added: (pred_2 obj_03 obj_07)
   goals met: 2 of 3
8. (op_2 obj_03 obj_10 obj_07 obj_05)
   deleted: (pred_1 obj_10 obj_07) (pred_4 obj_03 obj_05)
   added: (pred_3 obj_03 obj_10 obj_05)
   goals met: 2 of 3
9. (op_1 obj_03 obj_07 obj_02)
   deleted: (pred_2 obj_03 obj_07)
   added: (pred_2 obj_03 obj_02)
   goals met: 2 of 3
10. (op_3 obj_03 obj_10 obj_02 obj_05)
   deleted: (pred_3 obj_03 obj_10 obj_05)
   added: (pred_1 obj_10 obj_02) (pred_4 obj_03 obj_05)
   goals met: 3 of 3
